html/material/lvm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LVM 入门</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">LVM 入门</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orged8595d">LVM基本组成</a></li>
<li><a href="#org7fc9dcd">优点</a></li>
<li><a href="#orgb4c4ae7">缺点</a></li>
<li><a href="#org275e16d">准备</a></li>
<li><a href="#org3236fb7">在LVM上安装 Linux</a>
<ul>
<li><a href="#org3c31be1">创建分区</a></li>
<li><a href="#org33c84d6">创建物理卷</a></li>
<li><a href="#org9e232dc">创建卷组</a>
<ul>
<li><a href="#org1f0a958">一步创建卷组</a></li>
</ul>
</li>
<li><a href="#org2b52f57">创建逻辑卷</a></li>
<li><a href="#orgf275963">建立文件系统与挂载逻辑卷</a></li>
<li><a href="#orgc1eebc6">配置 mkinitcpio.conf</a>
<ul>
<li><a href="#org2b8c3eb">busybox</a></li>
<li><a href="#orgc6dbd45">systemd</a></li>
</ul>
</li>
<li><a href="#orgb584a04">内核启动参数</a></li>
</ul>
</li>
</ul>
</div>
</div>
<pre class="example">
引用 Wikipedia:Logical Volume Manager  的解释
</pre>
<p>
LVM 是一种可用在 <span class="underline">Linux 内核</span> 的 <b>逻辑分卷</b> 管理器，可用于管理磁盘驱动器或其他类似的大容量存储设备
</p>
<div id="outline-container-orged8595d" class="outline-2">
<h2 id="orged8595d">LVM基本组成</h2>
<div class="outline-text-2" id="text-orged8595d">
<p>
LVM利用Linux内核的 <span class="underline">device-mapper</span> 功能来实现 <b>存储系统的虚拟化</b> （系统分区独立于底层硬件）
</p>

<pre class="example">
通过LVM：

可以实现存储空间的抽象化并在上面建立虚拟分区（virtual partitions）
可以更简便地扩大和缩小分区
可以增删分区时无需担心某个硬盘上没有足够的连续空间

避免为正在使用的磁盘重新分区的麻烦、为调整分区而不得不移动其他分区的不便
</pre>

<p>
LVM的基本组成部分如下：
</p>
<ul class="org-ul">
<li><b>物理卷</b>  ( <span class="underline">PV</span> )：一个可供存储LVM的块设备，，它包含一个 <b>特殊的LVM头</b></li>
</ul>
<pre class="example">
例如: 一块硬盘, 一个MBR或GPT分区, 一个回环文件, 一个被内核映射的设备 (例如 dm-crypt)
</pre>
<ul class="org-ul">
<li><b>卷组</b> ( <span class="underline">VG</span> ) :   <span class="underline">物理卷</span> 的一个 <span class="underline">组</span> ，作为 <b>存放</b> <span class="underline">逻辑卷</span> 的 <b>容器</b></li>
<li><b>逻辑卷</b> ( <span class="underline">LV</span> ):  逻辑卷存放在一个 <span class="underline">卷组</span> 中并由物理块组成</li>
</ul>
<pre class="example">
一个类似于物理设备的块设备

例如，可以直接在它上面创建一个文件系统文件系统
</pre>
<ul class="org-ul">
<li><b>物理块</b> ( <span class="underline">PE</span> )：一个 <span class="underline">卷组</span> 中 <b>最小的连续区域</b> (默认为 <span class="underline">4 MiB</span> )，多个物理块将被分配给一个逻辑卷</li>
</ul>
<pre class="example">
可以把它看成物理卷的一部分，这部分可以被分配给一个逻辑卷
</pre>

<p>
示例:
</p>

<pre class="example">
'''物理硬盘'''

  硬盘1 (/dev/sda):
     _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ 
    |分区1 50GB (物理卷)           |分区2 80GB (物理卷)            |
    |/dev/sda1                    |/dev/sda2                     |
    |_ _ _ _ _ _ _ _ _ _ _ _ _ _ _|_ _ _ _ _ _ _ _ _ _ _ _ _ _ __|

  硬盘2 (/dev/sdb):
     _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
    |分区1 120GB (物理卷)                         |
    |/dev/sdb1                                         |
    | _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _   |

 '''LVM逻辑卷'''

   卷组（Volume Group1） (/dev/MyVolGroup/ = /dev/sda1 + /dev/sda2 + /dev/sdb1):
      _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ __ 
     |逻辑卷1 15GB                  |逻辑卷2 35GB                        |逻辑卷3 200GB                         |
     |/dev/MyVolGroup/rootvol        |/dev/MyVolGroup/homevol             |/dev/MyVolGroup/mediavol              |
     |_ _ _ _ _ _ _ _ _ _ _ _ _ _ __|_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ __ |_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _|
</pre>
</div>
</div>
<div id="outline-container-org7fc9dcd" class="outline-2">
<h2 id="org7fc9dcd">优点</h2>
<div class="outline-text-2" id="text-org7fc9dcd">
<p>
比起普通的硬盘分区管理方式，LVM更富于灵活性：
</p>
<ul class="org-ul">
<li>将多块硬盘看作一块大硬盘</li>
<li>使用逻辑卷（LV），可以创建跨越众多硬盘空间的分区</li>
<li>可以创建小的逻辑卷（LV），在空间不足时再动态调整它的大小</li>
<li>在调整逻辑卷（LV）大小时可以不用考虑逻辑卷在硬盘上的位置，不用担心没有可用的连续空间</li>
<li>可以在线对逻辑卷（LV）和卷组（VG）进行创建、删除、调整大小等操作</li>
</ul>
<pre class="example">
不过LVM上的文件系统也需要重新调整大小，好在某些文件系统（例如ext4）也支持在线操作
</pre>
<ul class="org-ul">
<li>无需重新启动服务，就可以将服务中用到的逻辑卷（LV）在线/动态迁移至别的硬盘上</li>
<li>允许创建快照，可以保存文件系统的备份，同时使服务的下线时间降低到最小</li>
<li>支持各种设备映射目标（device-mapper targets），包括透明文件系统加密和缓存常用数据</li>
</ul>
<pre class="example">
这将允许你创建一个包含一个或多个磁盘、并用LUKS加密的系统

使用LVM on top 可轻松地管理和调整这些独立的加密卷 （例如. /, /home, /backup等) 并免去开机时多次输入密钥的麻烦
</pre>
</div>
</div>
<div id="outline-container-orgb4c4ae7" class="outline-2">
<h2 id="orgb4c4ae7">缺点</h2>
<div class="outline-text-2" id="text-orgb4c4ae7">
<ul class="org-ul">
<li>在系统设置时需要更复杂的额外步骤</li>
<li>Windows系统并不支持LVM，若使用双系统，将无法在Windows上访问LVM分区</li>
</ul>
</div>
</div>
<div id="outline-container-org275e16d" class="outline-2">
<h2 id="org275e16d">准备</h2>
<div class="outline-text-2" id="text-org275e16d">
<p>
确保已安装 <span class="underline">lvm2</span> 软件包 
</p>
</div>
</div>
<div id="outline-container-org3236fb7" class="outline-2">
<h2 id="org3236fb7">在LVM上安装 Linux</h2>
<div class="outline-text-2" id="text-org3236fb7">
<p>
应该在 linux安装过程 中的的分区和创建文件系统这一步中创建LVM卷。 <b>不要直接格式化</b> 一个分区作为根文件系统（/），而应将其 <b>创建</b> 在一个 <span class="underline">逻辑卷</span> （LV）中 。快速导览：
</p>
<ol class="org-ol">
<li>创建物理卷（PV）所在的分区</li>
<li>创建物理卷（PV）：
<ul class="org-ul">
<li>如果只有一个硬盘，那么最好只创建一个分区一个物理卷</li>
<li>如果你有多个硬盘，可以创建多个分区，在每个分区上分别创建一个物理卷</li>
</ul></li>
<li>创建卷组（VG），并把所有物理卷加进卷组</li>
<li>在卷组（VG）上创建逻辑卷（LV）</li>
<li>继续格式化分区步骤</li>
<li>当做到的“Initramfs”步骤时，把 lvm2加入到 <span class="underline">mkinitcpio.conf</span> 文件中（这一步只是Arch有效, 实际上要获得的效果是启动Linux的适合能找到编译好的 lvm2 模块）</li>
</ol>

<pre class="example">
警告： 若使用不支持LVM的引导程序，/boot不能置于LVM中

必须创建一个独立的/boot分区并直接格式化它，已知支持LVM的引导程序只有GRUB
</pre>
</div>
<div id="outline-container-org3c31be1" class="outline-3">
<h3 id="org3c31be1">创建分区</h3>
<div class="outline-text-3" id="text-org3c31be1">
<p>
在继续配置LVM前，必须对设备进行分区。创建分区：
</p>
<ul class="org-ul">
<li>若使用 <span class="underline">MBR</span> ,设置 分区类型为 <span class="underline">8e</span></li>
</ul>
<pre class="example">
在"fdisk"中为Linux LVM
</pre>
<ul class="org-ul">
<li>若使用 <span class="underline">GPT</span> , 设置分区类型为 <span class="underline">E6D6D379-F507-44C2-A23C-238F2A3DF928</span></li>
</ul>
<pre class="example">
在"fdisk"中为Linux LVM

在"gdisk"中为8e00
</pre>
</div>
</div>
<div id="outline-container-org33c84d6" class="outline-3">
<h3 id="org33c84d6">创建物理卷</h3>
<div class="outline-text-3" id="text-org33c84d6">
<p>
可通过以下命令列出可被用作物理卷的设备：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ lvmdiskscan
</pre>
</div>

<pre class="example">
警告： 请确认对正确的设备进行操作，否则会导致文件丢失！
</pre>

<p>
在列出的设备上创建物理卷：
</p>
<pre class="example">
# pvcreate DEVICE  
</pre>

<p>
该命令在各个设备上创建LVM头。如#LVM基本组成所示, DEVICE可以是：
</p>
<ul class="org-ul">
<li>磁盘（如/dev/sda）</li>
<li>分区（如/dev/sda2）</li>
<li>环回设备</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">$ pvcreate /dev/sda2
</pre>
</div>

<p>
可以用以下命令查看已创建好的物理卷：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ pvdisplay
</pre>
</div>

<pre class="example">
注意： 如果用的是未格式化过且擦除块（erase block）大小 小于1M 的SSD，请采用以下命令pvcreate --dataalignment 1m /dev/sda来设置对齐（alignment）
</pre>
</div>
</div>

<div id="outline-container-org9e232dc" class="outline-3">
<h3 id="org9e232dc">创建卷组</h3>
<div class="outline-text-3" id="text-org9e232dc">
<p>
创建完成物理卷（PV）之后，下一步就是在该物理卷创建卷组（VG）了。 首先必须先在其中一个物理卷（PV）创建一个卷组：
</p>

<pre class="example">
# vgcreate &lt;volume_group&gt; &lt;physical_volume&gt;
</pre>

<p>
可用作字符卷组的名称可在lvm(8)中查到。例如：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ vgcreate VolGroup00 /dev/sda2
</pre>
</div>

<p>
然后让该卷组扩大到其他所有的物理卷:
</p>

<pre class="example">
# vgextend &lt;卷组名&gt; &lt;物理卷&gt;
# vgextend &lt;卷组名&gt; &lt;其它物理卷&gt;
# ...
</pre>

<p>
例如：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ vgextend VolGroup00 /dev/sdb1
$ vgextend VolGroup00 /dev/sdc
</pre>
</div>

<p>
其中，“VolGroup00”名字换成自己起的名字即可。 接下来可以用以下命令查看卷组：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ vgdisplay
</pre>
</div>

<pre class="example">
注意： 可以创建多个的卷组，但这将使你的硬盘空间分布在不同（逻辑）磁盘上
</pre>
</div>

<div id="outline-container-org1f0a958" class="outline-4">
<h4 id="org1f0a958">一步创建卷组</h4>
<div class="outline-text-4" id="text-org1f0a958">
<p>
LVM支持将卷组与物理卷的创建聚合在一个命令中。例如，为了在前文提到的三个设备中创建名为VolGroup00的卷组，可以执行如下命令：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ vgcreate VolGroup00 /dev/sda2 /dev/sdb1 /dev/sdc
</pre>
</div>

<p>
该命令首先会在分区上创建物理卷（如果之前没有创建过），再创建一个包含三个物理卷的卷组
</p>

<pre class="example">
如果设备上已经存在文件系统，命令会提出警告
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b52f57" class="outline-3">
<h3 id="org2b52f57">创建逻辑卷</h3>
<div class="outline-text-3" id="text-org2b52f57">
<p>
创建完卷组（VG）之后，就可以开始创建逻辑卷（LV）了。输入下面命令以指定新逻辑卷的名字、大小及其所在的卷组：
</p>
<pre class="example">
# lvcreate -L &lt;卷大小&gt; &lt;"卷组名&gt; -n &lt;卷名&gt;
</pre>
<p>
例如：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ lvcreate -L 10G VolGroup00 -n lvolhome
</pre>
</div>

<p>
该逻辑卷创建完后，就可以通过 <span class="underline">/dev/mapper/Volgroup00-lvolhome</span> 或 <span class="underline">/dev/VolGroup00/lvolhome</span> 来访问它
</p>

<pre class="example">
与卷组命名类似，你可以按你的需要将逻辑卷命名
</pre>

<p>
可以指定一个或多个物理卷来限制LVM分配数据空间的位置。比如希望在较小的SSD硬盘上创建根文件系统，并在较慢的机械硬盘上创建家目录卷，仅需把物理卷设备加入到命令中
</p>
<div class="org-src-container">
<pre class="src src-sh">$ lvcreate -L 10G VolGroup00 -n lvolhome /dev/sdc1
</pre>
</div>

<p>
如果想让要创建的逻辑卷拥有卷组（VG）的所有未使用空间，请使用以下命令：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ lvcreate -l +100%FREE  &lt;volume_group&gt; -n &lt;logical_volume&gt;
</pre>
</div>
<p>
可以通过以下命令来查看逻辑卷：
</p>
<div class="org-src-container">
<pre class="src src-sh">$ lvdisplay
</pre>
</div>
<pre class="example">
提示： 一开始可以创建小一点的逻辑卷，在卷组里留下一部分未使用空间，以后就可以根据需要再作扩展了
</pre>
</div>
</div>

<div id="outline-container-orgf275963" class="outline-3">
<h3 id="orgf275963">建立文件系统与挂载逻辑卷</h3>
<div class="outline-text-3" id="text-orgf275963">
<p>
现在的逻辑卷应该已经在 <span class="underline"><i>dev/mapper</i></span> 和 <span class="underline">/dev/YourVolumeGroupName</span> 中了。如果无法在以上位置找到它，请使用以下命令来加载模块、并扫描与激活卷组：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ modprobe dm-mod
$ vgscan
$ vgchange -ay
</pre>
</div>
<p>
现在可以在逻辑卷上创建文件系统并像普通分区一样挂载它了：
</p>

<pre class="example">
# mkfs.&lt;类型&gt; /dev/mapper/&lt;卷组名&gt;-&lt;卷名&gt;
# mount /dev/mapper/&lt;卷组名&gt;-&lt;卷名&gt; &lt;挂载点&gt;
</pre>
<p>
例如：
</p>

<div class="org-src-container">
<pre class="src src-sh">$ mkfs.ext4 /dev/mapper/VolGroup00-lvolhome
$ mount /dev/mapper/VolGroup00-lvolhome /home
</pre>
</div>
<pre class="example">
警告： 挂载点请选择所新建的逻辑卷（例如：/dev/mapper/Volgroup00-lvolhome）

不要使用逻辑卷所在的实际分区设备（即不要使用：/dev/sda2）
</pre>
</div>
</div>
<div id="outline-container-orgc1eebc6" class="outline-3">
<h3 id="orgc1eebc6">配置 mkinitcpio.conf</h3>
<div class="outline-text-3" id="text-orgc1eebc6">
<p>
如果根文件系统基于LVM，需要启用适当的mkinitcpio钩子，否则系统可能无法启动：
</p>
<ul class="org-ul">
<li>若使用基于busybox的initramfs，请启用 <span class="underline">udev</span> 和 <span class="underline">lvm2</span></li>
<li>若使用基于systemd的initramfs，请启用 <span class="underline">systemd</span> 和 <span class="underline">sd-lvm2</span></li>
</ul>
</div>

<div id="outline-container-org2b8c3eb" class="outline-4">
<h4 id="org2b8c3eb">busybox</h4>
<div class="outline-text-4" id="text-org2b8c3eb">
<p>
udev默认已经预设好，不必手动启用了。只需要编辑/etc/mkinitcpio.conf文件，在block与filesystem这两项中间插入lvm2：
</p>

<p>
基于busybox的initramfs: /etc/mkinitcpio.conf
</p>
<pre class="example">
HOOKS="base udev ... block lvm2 filesystems"
</pre>
</div>
</div>
<div id="outline-container-orgc6dbd45" class="outline-4">
<h4 id="orgc6dbd45">systemd</h4>
<div class="outline-text-4" id="text-orgc6dbd45">
<p>
基于systemd的initramfs: /etc/mkinitcpio.conf
</p>
<pre class="example">
HOOKS=(base systemd ... block sd-lvm2 filesystems)
</pre>

<pre class="example">
提示：lvm2和sd-lvm2钩子被lvm2安装，而不是mkinitcpio

如果你在"arch-chroot"中新安装的Arch Linux中运行"mkinitcpio"，必须在环境中安装lvm2以使mkinitcpio找到lvm2或sd-lvm2钩子

如果lvm2未安装, mkinitcpio将报错：Error: Hook 'lvm2' cannot be found.

若根文件系统在LVM + RAID上，请参见#为RAID配置mkinitcpioZ
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb584a04" class="outline-3">
<h3 id="orgb584a04">内核启动参数</h3>
<div class="outline-text-3" id="text-orgb584a04">
<p>
如果根文件系统位于逻辑分卷，则root= 内核参数必须指向一个映射设备，比如/dev/mapper/vg-name-lv-name
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
